fio/ceph-file-layout/bs_su256k_o1m/randr_s1m_j128.out
randr: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 128 threads

randr: (groupid=0, jobs=128): err= 0: pid=85339: Fri Feb 21 09:03:08 2020
  read: IOPS=37.5k, BW=293MiB/s (307MB/s)(85.9GiB/300013msec)
    slat (usec): min=27, max=21590, avg=2573.18, stdev=2215.86
    clat (nsec): min=631, max=236368k, avg=834923.15, stdev=697956.68
     lat (usec): min=413, max=236887, avg=3408.47, stdev=2330.57
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[  537], 10.00th=[  594], 20.00th=[  644],
     | 30.00th=[  685], 40.00th=[  717], 50.00th=[  758], 60.00th=[  799],
     | 70.00th=[  848], 80.00th=[  922], 90.00th=[ 1074], 95.00th=[ 1303],
     | 99.00th=[ 3163], 99.50th=[ 4293], 99.90th=[ 6194], 99.95th=[ 6849],
     | 99.99th=[ 9372]
   bw (  KiB/s): min=195921, max=459179, per=100.00%, avg=300638.89, stdev=339.17, samples=76544
   iops        : min=24489, max=57397, avg=37579.78, stdev=42.40, samples=76544
  lat (nsec)   : 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.66%, 4=1.09%, 10=0.08%, 20=0.02%, 50=0.09%
  lat (usec)   : 100=0.26%, 250=0.71%, 500=1.01%, 750=44.60%, 1000=37.70%
  lat (msec)   : 2=11.94%, 4=1.22%, 10=0.61%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.11%, sys=25.66%, ctx=32487226, majf=0, minf=55563
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=11258097,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=293MiB/s (307MB/s), 293MiB/s-293MiB/s (307MB/s-307MB/s), io=85.9GiB (92.2GB), run=300013-300013msec