fio/ceph-file-layout/bs_su256k_o1m/randr_s2g_j128.out
randr: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 128 threads
randr: Laying out IO file (1 file / 2048MiB)
randr: Laying out IO file (1 file / 2048MiB)
randr: Laying out IO file (1 file / 2048MiB)
[...]

randr: (groupid=0, jobs=128): err= 0: pid=76273: Fri Feb 21 06:50:13 2020
  read: IOPS=4756, BW=37.2MiB/s (38.0MB/s)(10.9GiB/300062msec)
    slat (usec): min=23, max=1638, avg=53.38, stdev=15.30
    clat (usec): min=4, max=532054, avg=26847.16, stdev=17726.47
     lat (usec): min=493, max=532094, avg=26900.74, stdev=17726.47
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[   10], 10.00th=[   12], 20.00th=[   15],
     | 30.00th=[   17], 40.00th=[   20], 50.00th=[   23], 60.00th=[   27],
     | 70.00th=[   31], 80.00th=[   37], 90.00th=[   48], 95.00th=[   59],
     | 99.00th=[   89], 99.50th=[  106], 99.90th=[  157], 99.95th=[  190],
     | 99.99th=[  292]
   bw (  KiB/s): min=16592, max=56080, per=100.00%, avg=38110.50, stdev=45.48, samples=76546
   iops        : min= 2074, max= 7010, avg=4763.53, stdev= 5.69, samples=76546
  lat (usec)   : 10=0.01%, 500=0.01%, 750=0.59%, 1000=0.19%
  lat (msec)   : 2=0.12%, 4=0.26%, 10=5.33%, 20=35.34%, 50=49.68%
  lat (msec)   : 100=7.86%, 250=0.60%, 500=0.02%, 750=0.01%
  cpu          : usr=0.02%, sys=0.16%, ctx=2720629, majf=0, minf=30591
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1427374,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=37.2MiB/s (38.0MB/s), 37.2MiB/s-37.2MiB/s (38.0MB/s-38.0MB/s), io=10.9GiB (11.7GB), run=300062-300062msec