fio/ceph-file-layout/bs_su256k_o1m/randr_s2g_j16.out
randr: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 16 threads

randr: (groupid=0, jobs=16): err= 0: pid=77607: Fri Feb 21 07:06:46 2020
  read: IOPS=1769, BW=13.8MiB/s (14.5MB/s)(4147MiB/300021msec)
    slat (usec): min=23, max=817, avg=48.34, stdev=10.77
    clat (usec): min=46, max=314976, avg=8992.10, stdev=12672.43
     lat (usec): min=410, max=315026, avg=9040.59, stdev=12672.49
    clat percentiles (usec):
     |  1.00th=[   553],  5.00th=[   603], 10.00th=[   644], 20.00th=[   709],
     | 30.00th=[  1221], 40.00th=[  6390], 50.00th=[  8160], 60.00th=[  9241],
     | 70.00th=[ 10028], 80.00th=[ 11600], 90.00th=[ 15926], 95.00th=[ 21890],
     | 99.00th=[ 71828], 99.50th=[ 90702], 99.90th=[135267], 99.95th=[162530],
     | 99.99th=[225444]
   bw (  KiB/s): min= 4272, max=25952, per=100.00%, avg=14171.68, stdev=290.45, samples=9584
   iops        : min=  534, max= 3244, avg=1771.45, stdev=36.31, samples=9584
  lat (usec)   : 50=0.01%, 100=0.01%, 250=0.01%, 500=0.10%, 750=24.54%
  lat (usec)   : 1000=5.04%
  lat (msec)   : 2=1.18%, 4=2.79%, 10=36.45%, 20=23.99%, 50=4.17%
  lat (msec)   : 100=1.37%, 250=0.36%, 500=0.01%
  cpu          : usr=0.04%, sys=0.42%, ctx=1003115, majf=0, minf=9209
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=530841,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=13.8MiB/s (14.5MB/s), 13.8MiB/s-13.8MiB/s (14.5MB/s-14.5MB/s), io=4147MiB (4349MB), run=300021-300021msec