fio/ceph-file-layout/bs_su256k_o1m/randr_s2g_j8.out
randr: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 8 threads

randr: (groupid=0, jobs=8): err= 0: pid=77977: Fri Feb 21 07:12:17 2020
  read: IOPS=1567, BW=12.2MiB/s (12.8MB/s)(3674MiB/300027msec)
    slat (usec): min=22, max=648, avg=45.55, stdev= 9.79
    clat (usec): min=175, max=234220, avg=5056.50, stdev=6363.07
     lat (usec): min=397, max=234263, avg=5102.19, stdev=6363.12
    clat percentiles (usec):
     |  1.00th=[   537],  5.00th=[   578], 10.00th=[   611], 20.00th=[   652],
     | 30.00th=[   685], 40.00th=[   734], 50.00th=[  1467], 60.00th=[  6063],
     | 70.00th=[  8029], 80.00th=[  9372], 90.00th=[ 10945], 95.00th=[ 15008],
     | 99.00th=[ 22152], 99.50th=[ 26870], 99.90th=[ 81265], 99.95th=[102237],
     | 99.99th=[112722]
   bw (  KiB/s): min= 5872, max=23824, per=100.00%, avg=12554.34, stdev=744.57, samples=4792
   iops        : min=  734, max= 2978, avg=1569.29, stdev=93.07, samples=4792
  lat (usec)   : 250=0.01%, 500=0.25%, 750=41.60%, 1000=7.33%
  lat (msec)   : 2=1.42%, 4=3.51%, 10=31.89%, 20=12.53%, 50=1.31%
  lat (msec)   : 100=0.11%, 250=0.06%
  cpu          : usr=0.07%, sys=0.72%, ctx=858630, majf=0, minf=6125
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=470244,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=12.2MiB/s (12.8MB/s), 12.2MiB/s-12.2MiB/s (12.8MB/s-12.8MB/s), io=3674MiB (3852MB), run=300027-300027msec