fio/ceph-file-layout/bs_su256k_o1m/seqr_s2g_j8.out
seqr: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 8 threads

seqr: (groupid=0, jobs=8): err= 0: pid=71595: Fri Feb 21 05:36:45 2020
  read: IOPS=9012, BW=563MiB/s (591MB/s)(165GiB/300001msec)
    slat (usec): min=19, max=936, avg=46.53, stdev=13.70
    clat (usec): min=3, max=20820, avg=839.62, stdev=279.95
     lat (usec): min=510, max=20862, avg=886.30, stdev=280.70
    clat percentiles (usec):
     |  1.00th=[  603],  5.00th=[  652], 10.00th=[  676], 20.00th=[  709],
     | 30.00th=[  742], 40.00th=[  766], 50.00th=[  799], 60.00th=[  832],
     | 70.00th=[  873], 80.00th=[  922], 90.00th=[ 1004], 95.00th=[ 1074],
     | 99.00th=[ 1352], 99.50th=[ 2868], 99.90th=[ 4752], 99.95th=[ 5080],
     | 99.99th=[ 5735]
   bw (  KiB/s): min=542080, max=604544, per=100.00%, avg=577466.46, stdev=1213.05, samples=4784
   iops        : min= 8470, max= 9446, avg=9022.91, stdev=18.95, samples=4784
  lat (usec)   : 4=0.01%, 10=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=33.48%, 1000=56.35%
  lat (msec)   : 2=9.47%, 4=0.47%, 10=0.22%, 20=0.01%, 50=0.01%
  cpu          : usr=0.35%, sys=4.49%, ctx=4568393, majf=0, minf=25364
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2703719,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=563MiB/s (591MB/s), 563MiB/s-563MiB/s (591MB/s-591MB/s), io=165GiB (177GB), run=300001-300001msec