fio/ceph-file-layout/bs_su256k_o1m/seqw_s2g_j16.out
seqw: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 16 threads

seqw: (groupid=0, jobs=16): err= 0: pid=74299: Fri Feb 21 06:15:28 2020
  write: IOPS=5391, BW=337MiB/s (353MB/s)(98.8GiB/300079msec)
    slat (usec): min=20, max=969, avg=83.87, stdev=31.13
    clat (usec): min=203, max=510241, avg=2881.08, stdev=10841.08
     lat (usec): min=817, max=510336, avg=2965.15, stdev=10841.06
    clat percentiles (usec):
     |  1.00th=[   922],  5.00th=[  1020], 10.00th=[  1090], 20.00th=[  1188],
     | 30.00th=[  1270], 40.00th=[  1385], 50.00th=[  1500], 60.00th=[  1631],
     | 70.00th=[  1795], 80.00th=[  2114], 90.00th=[  4359], 95.00th=[  5211],
     | 99.00th=[ 25822], 99.50th=[ 72877], 99.90th=[173016], 99.95th=[212861],
     | 99.99th=[295699]
   bw (  KiB/s): min= 3072, max=721536, per=100.00%, avg=345566.37, stdev=10804.11, samples=9584
   iops        : min=   48, max=11274, avg=5399.46, stdev=168.81, samples=9584
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=3.95%
  lat (msec)   : 2=73.60%, 4=10.56%, 10=10.48%, 20=0.32%, 50=0.35%
  lat (msec)   : 100=0.40%, 250=0.31%, 500=0.02%, 750=0.01%
  cpu          : usr=0.14%, sys=1.61%, ctx=2875330, majf=0, minf=34563
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1618012,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=337MiB/s (353MB/s), 337MiB/s-337MiB/s (353MB/s-353MB/s), io=98.8GiB (106GB), run=300079-300079msec